/* ==== Stage 1 – ==== */
/* 上 → 右 → 下 → 左 → 上 */
window.STAGE_DATA = {
    grid: [
        ['#', '#', 'G', '#', '#', '#', '#', '#'],
        ['#', '.', '.', '.', '.', '.', '.', '#'],
        ['#', '#', '.', '.', '.', '.', '.', '#'],
        ['#', '.', '.', '.', '.', '.', '#', '#'],
        ['#', '.', '.', '.', '.', 'S', '#', '#'],
        ['#', '#', '#', '#', '#', '#', '#', '#']
    ],
    // 使用できる slide_* ブロック数上限
    blockLimit: 5,
    tutorial: {
        title: 'プレイヤーは壁にぶつかるまで氷の上を滑って止まれない！壁にぶつかりながらゴールにたどりつこう！',
        body: 'プレイヤー → 🟠 ゴール → 🟥'
    }
};



