/* ==== Stage 7 – ==== */
/* 上 → 右 → 下 → 右 */
window.STAGE_DATA = {
    grid: [
    /* y0 */['#', '#', '#', 'W', '#', '#', '#', '#'],
    /* y1 */['#', '.', '.', '.', '.', '.', 'G', '#'],
    /* y2 */['#', '#', '.', '#', '.', '.', '.', '#'],
    /* y3 */['#', '.', '.', '.', '#', '.', '#', '#'],
    /* y4 */['#', 'S', '#', 'W', '.', '.', '.', '#'],
    /* y5 */['#', '#', '#', '#', '#', '#', '#', '#']
    ],
    blockLimit: 4,
    tutorial: {
        title: 'ワープ床では同じ色のワープ床まで瞬間移動し、入った時と同じ移動方向で進み続ける！氷の上を滑ってゴールにたどりつこう！',
        body: 'ワープ床 → 🌀 プレイヤー → 🟠 ゴール → 🟥'
    }
};

